const request = require("request");
const fs = require("fs-extra");
const moment = require("moment-timezone");

module.exports.config = {
    name: "admin",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "ULLASH", //don't change my credit 
    description: "Show Owner Info",
    commandCategory: "info",
    usages: "",
    cooldowns: 5
};

module.exports.run = async function({ api, event }) {
    var time = moment().tz("Asia/Dhaka").format("DD/MM/YYYY hh:mm:ss A");

    var callback = () => api.sendMessage({
        body: `
┣━━━━━━━━━━━━━━━┫
┃ 『 ཐི༏ཋྀ𓆩𝗔𝗗𝗠𝗜𝗡𓆪 ཐི༏ཋྀ  』  
┣━━━━━━━━━━━━━━━┫
┃👤 𝐍𝐚𝐦𝐞          〲 𝐉𝐔𝐖𝐄𝐋    
┣━━━━━━━━━━━━━━━┫
┃𝐍𝐢𝐜𝐤 𝐍𝐚𝐦𝐞  〲𝐌𝐑 𝐉𝐔𝐖𝐄𝐋
┣━━━━━━━━━━━━━━━┫
┃ 🚹 𝐆𝐞𝐧𝐝𝐞𝐫      〲 𝐌𝐀𝐋𝐄    
┣━━━━━━━━━━━━━━━┫
┃ 😈𝐀𝐓𝐓𝐈𝐓𝐔𝐃𝐄 〲𝐊𝐈𝐍𝐆   
┣━━━━━━━━━━━━━━━┫
┃🎮𝐅𝐑𝐄𝐄 𝐅𝐈𝐑𝐄〲𝐋𝐎𝐕𝐄𝐑
┣━━━━━━━━━━━━━━━┫
💰𝐖𝐨𝐫𝐤〲𝐂𝐎𝐍𝐓𝐑𝐀𝐂𝐓𝐈𝐎𝐍
┣━━━━━━━━━━━━━━━┫
┃❤️ 𝐑𝐞𝐥𝐚𝐭𝐢𝐨𝐧  〲𝐒𝐈𝐍𝐆𝐄𝐋
┣━━━━━━━━━━━━━━━┫
┃🎂 𝐀𝐠𝐞          〲20+
┣━━━━━━━━━━━━━━━┫
┃ 🩸𝐁𝐥𝐨𝐝        〲𝐀+ 
┣━━━━━━━━━━━━━━━┫
┃ 🎂𝐁𝐢𝐫𝐭𝐡𝐝𝐚𝐲 〲𝐀𝐏𝐈𝐑𝐋 24
┣━━━━━━━━━━━━━━━┫
┃ 🕌 𝐑𝐞𝐥𝐢𝐠𝐢𝐨𝐧 〲𝐈𝐒𝐋𝐀𝐌
┣━━━━━━━━━━━━━━━┫
┃ 🏡 𝐀𝐝𝐝𝐫𝐞𝐬𝐬〲𝐑𝐀𝐍𝐆𝐏𝐔𝐑
┣━━━━━━━━━━━━━━━┫
┃🌐𝐌𝐞𝐬𝐬𝐞𝐧𝐠𝐞𝐫 ❯ ┃mrjuwel2025 
┣━━━━━━━━━━━━━━━┫
┃ 🌐 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 ❯ facebook.com/mrjuwel2025 
┣━━━━━━━━━━━━━━━┫
┃   🌐𝐖𝐡𝐚𝐭𝐬𝐚𝐩𝐩 ❯┃+8801943488192 
┣━━━━━━━━━━━━━━━┫
┃ 🌐 𝐓𝐢𝐤𝐭𝐨𝐤 ❯ mrjuwel2025
┣━━━━━━━━━━━━━━━┫
┃🌐 𝐓𝐞𝐥𝐞𝐠𝐫𝐚𝐦 ❯┃mrjuwel2025
┣━━━━━━━━━━━━━━━┫
┃🌐 𝐅𝐦𝐚𝐢𝐥 ❯ ┃www.mrjuwel2025
┃@gmail.com 
┣━━━━━━━━━━━━━━━┫
┃ 🕒 𝐔𝐩𝐝𝐚𝐭𝐞𝐝 𝐓𝐢𝐦𝐞:  ${time}
┗━━━━━━━━━━━━━━━┛
        `,
        attachment: fs.createReadStream(__dirname + "/cache/1.png")
    }, event.threadID, () => fs.unlinkSync(__dirname + "/cache/1.png"));
  
    const imageURL = "https://i.imgur.com/P7YaVy2.jpeg";

    return request(encodeURI(imageURL))
        .pipe(fs.createWriteStream(__dirname + '/cache/1.png'))
        .on('close', () => callback());
};
